---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomConstructionSetParam
source: html/43c6cfb6-1ece-c828-b9c9-3cc8e96298c0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomConstructionSetParam Property

"Construction Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomConstructionSetParam { get; }
```